#include "MyPG.h"
#include "MyGameMain.h"

//エンディング画面
namespace Ending
{
	//ゲ??情報
	DG::Image::SP		img;
	int					logoPosY;

	//-----------------------------------------------------------------------------
	//初期化処理
	//??概要：プログラ?起動時に１回実行される（素材などの?備を行う）
	//-----------------------------------------------------------------------------
	void Initialize()
	{
		img = DG::Image::Create("./data/image/Ending.bmp");
		logoPosY = 540; //エンディング画像の初期位置を画面外に配置する
	}
	//-----------------------------------------------------------------------------
	//解放処理
	//??概要：プログラ?終了時に１回実行される（素材などの解放を行う）
	//-----------------------------------------------------------------------------
	void Finalize()
	{
		img.reset();
	}
	//-----------------------------------------------------------------------------
	//更新処理
	//??概要：ゲ??の１フレ??に当たる処理
	//-----------------------------------------------------------------------------
	TaskFlag UpDate()
	{
		auto  inp = ge->in1->GetState();
		logoPosY -= 18;
		if (logoPosY  <  0) { logoPosY = 0; }

		TaskFlag rtv = TaskFlag::Ending;//取りあえず現在の?スクを指定
		if (logoPosY <= 0) {
			if (true == inp.ST.down) {
				rtv = TaskFlag::Title;	//次の?スク
			}
		}
		return rtv;
	}
	//-----------------------------------------------------------------------------
	//?画処理
	//??概要：ゲ??の１フレ??に当たる?示処理
	//-----------------------------------------------------------------------------
	void Render()
	{
		ML::Box2D  draw(0, 0, 960, 540);
		draw.Offset(0, logoPosY);
		ML::Box2D  src(0, 0, 960, 540);
		img->Draw(draw, src);
	}
}